In [13]:
people = {
"first": ["Corey", 'Jane', 'John','Adam'],
"last": ["Schafer", 'Doe', 'Doe','Doe'],
"email": ["CoreyMSchafer@gmail.com", 'Jane Doe@email.com', 'JohnDoe@email.com','AdamDoe@gmail.com']
}

In [14]:
import pandas as pd

In [15]:
df=pd.DataFrame(people)

In [16]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe       Jane Doe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe        AdamDoe@gmail.com

In [17]:
df.sort_values(by='last',ascending=False)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe       Jane Doe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe        AdamDoe@gmail.com

In [18]:
#When we want to sort it in multiple columns
df.sort_values(by=['last','first'],ascending=False)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
2   John      Doe        JohnDoe@email.com
1   Jane      Doe       Jane Doe@email.com
3   Adam      Doe        AdamDoe@gmail.com

In [20]:
#when we sort the multiple columns at one in asc and other one in desc 
df.sort_values(by=['last','first'],ascending=[False,True],inplace=True)

In [21]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
3   Adam      Doe        AdamDoe@gmail.com
1   Jane      Doe       Jane Doe@email.com
2   John      Doe        JohnDoe@email.com

In [22]:
#in case if you want to get back to the old DataFrame then we use
df.sort_index()

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe       Jane Doe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe        AdamDoe@gmail.com

In [23]:
#when we want sort only one colums
df['last'].sort_values()

3        Doe
1        Doe
2        Doe
0    Schafer
Name: last, dtype: object